Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_rfd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/pps.h
#define PPS_SCOM0P3R_SCOM0P3_Pos              _UINT32_(0)                                          /* (PPS_SCOM0P3R) SERCOM0/PAD3 Position */
#define PPS_SCOM0P3R_SCOM0P3_Msk              (_UINT32_(0xF) << PPS_SCOM0P3R_SCOM0P3_Pos)          /* (PPS_SCOM0P3R) SERCOM0/PAD3 Mask */
#define PPS_SCOM0P3R_SCOM0P3(value)           (PPS_SCOM0P3R_SCOM0P3_Msk & (_UINT32_(value) << PPS_SCOM0P3R_SCOM0P3_Pos)) /* Assigment of value for SCOM0P3 in the PPS_SCOM0P3R register */
#define   PPS_SCOM0P3R_SCOM0P3_RPA9_Val       _UINT32_(0xF)                                        /* (PPS_SCOM0P3R) RPA9  */
#define   PPS_SCOM0P3R_SCOM0P3_RPA3_Val       _UINT32_(0x1)                                        /* (PPS_SCOM0P3R) RPA3  */
#define   PPS_SCOM0P3R_SCOM0P3_RPA7_Val       _UINT32_(0x2)                                        /* (PPS_SCOM0P3R) RPA7  */
#define   PPS_SCOM0P3R_SCOM0P3_RPA11_Val      _UINT32_(0x3)                                        /* (PPS_SCOM0P3R) RPA11  */
#define   PPS_SCOM0P3R_SCOM0P3_RPB0_Val       _UINT32_(0x4)                                        /* (PPS_SCOM0P3R) RPB0  */
#define   PPS_SCOM0P3R_SCOM0P3_RPB4_Val       _UINT32_(0x5)                                        /* (PPS_SCOM0P3R) RPB4  */
#define   PPS_SCOM0P3R_SCOM0P3_RPB8_Val       _UINT32_(0x6)                                        /* (PPS_SCOM0P3R) RPB8  */
#define   PPS_SCOM0P3R_SCOM0P3_RPB12_Val      _UINT32_(0x7)                                        /* (PPS_SCOM0P3R) RPB12  */
#define   PPS_SCOM0P3R_SCOM0P3_RPA2_Val       _UINT32_(0x8)                                        /* (PPS_SCOM0P3R) RPA2  */
#define   PPS_SCOM0P3R_SCOM0P3_RPA6_Val       _UINT32_(0x9)                                        /* (PPS_SCOM0P3R) RPA6  */
#define   PPS_SCOM0P3R_SCOM0P3_RPA10_Val      _UINT32_(0xA)                                        /* (PPS_SCOM0P3R) RPA10  */
#define   PPS_SCOM0P3R_SCOM0P3_RPA14_Val      _UINT32_(0xB)                                        /* (PPS_SCOM0P3R) RPA14  */
#define   PPS_SCOM0P3R_SCOM0P3_RPB3_Val       _UINT32_(0xC)                                        /* (PPS_SCOM0P3R) RPB3  */
#define   PPS_SCOM0P3R_SCOM0P3_RPB7_Val       _UINT32_(0xD)                                        /* (PPS_SCOM0P3R) RPB7  */
#define   PPS_SCOM0P3R_SCOM0P3_RPB11_Val      _UINT32_(0xE)                                        /* (PPS_SCOM0P3R) RPB11  */
#define   PPS_SCOM0P3R_SCOM0P3_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM0P3R) OFF  */
#define PPS_SCOM0P3R_SCOM0P3_RPA9             (PPS_SCOM0P3R_SCOM0P3_RPA9_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPA9 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPA3             (PPS_SCOM0P3R_SCOM0P3_RPA3_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPA3 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPA7             (PPS_SCOM0P3R_SCOM0P3_RPA7_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPA7 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPA11            (PPS_SCOM0P3R_SCOM0P3_RPA11_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPA11 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPB0             (PPS_SCOM0P3R_SCOM0P3_RPB0_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPB0 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPB4             (PPS_SCOM0P3R_SCOM0P3_RPB4_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPB4 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPB8             (PPS_SCOM0P3R_SCOM0P3_RPB8_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPB8 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPB12            (PPS_SCOM0P3R_SCOM0P3_RPB12_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPB12 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPA2             (PPS_SCOM0P3R_SCOM0P3_RPA2_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPA2 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPA6             (PPS_SCOM0P3R_SCOM0P3_RPA6_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPA6 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPA10            (PPS_SCOM0P3R_SCOM0P3_RPA10_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPA10 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPA14            (PPS_SCOM0P3R_SCOM0P3_RPA14_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPA14 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPB3             (PPS_SCOM0P3R_SCOM0P3_RPB3_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPB3 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPB7             (PPS_SCOM0P3R_SCOM0P3_RPB7_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPB7 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPB11            (PPS_SCOM0P3R_SCOM0P3_RPB11_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPB11 Position  */
#define PPS_SCOM0P3R_SCOM0P3_OFF              (PPS_SCOM0P3R_SCOM0P3_OFF_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) OFF Position  */
#define PPS_SCOM0P3R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM0P3R) Register Mask  */


/* -------- PPS_SCOM1P0R : (PPS Offset: 0x50) (R/W 32)  -------- */
#define PPS_SCOM1P0R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM1P0R)   Reset Value */

#define PPS_SCOM1P0R_SCOM1P0_Pos              _UINT32_(0)                                          /* (PPS_SCOM1P0R) SERCOM1/PAD0 Position */
#define PPS_SCOM1P0R_SCOM1P0_Msk              (_UINT32_(0xF) << PPS_SCOM1P0R_SCOM1P0_Pos)          /* (PPS_SCOM1P0R) SERCOM1/PAD0 Mask */
#define PPS_SCOM1P0R_SCOM1P0(value)           (PPS_SCOM1P0R_SCOM1P0_Msk & (_UINT32_(value) << PPS_SCOM1P0R_SCOM1P0_Pos)) /* Assigment of value for SCOM1P0 in the PPS_SCOM1P0R register */
#define   PPS_SCOM1P0R_SCOM1P0_RPA1_Val       _UINT32_(0xF)                                        /* (PPS_SCOM1P0R) RPA1  */
#define   PPS_SCOM1P0R_SCOM1P0_RPA5_Val       _UINT32_(0x1)                                        /* (PPS_SCOM1P0R) RPA5  */
#define   PPS_SCOM1P0R_SCOM1P0_RPA9_Val       _UINT32_(0x2)                                        /* (PPS_SCOM1P0R) RPA9  */
#define   PPS_SCOM1P0R_SCOM1P0_RPA13_Val      _UINT32_(0x3)                                        /* (PPS_SCOM1P0R) RPA13  */
#define   PPS_SCOM1P0R_SCOM1P0_RPB2_Val       _UINT32_(0x4)                                        /* (PPS_SCOM1P0R) RPB2  */
#define   PPS_SCOM1P0R_SCOM1P0_RPB6_Val       _UINT32_(0x5)                                        /* (PPS_SCOM1P0R) RPB6  */
#define   PPS_SCOM1P0R_SCOM1P0_RPB10_Val      _UINT32_(0x6)                                        /* (PPS_SCOM1P0R) RPB10  */
#define   PPS_SCOM1P0R_SCOM1P0_RPA0_Val       _UINT32_(0x7)                                        /* (PPS_SCOM1P0R) RPA0  */
#define   PPS_SCOM1P0R_SCOM1P0_RPA4_Val       _UINT32_(0x8)                                        /* (PPS_SCOM1P0R) RPA4  */
#define   PPS_SCOM1P0R_SCOM1P0_RPA8_Val       _UINT32_(0x9)                                        /* (PPS_SCOM1P0R) RPA8  */
#define   PPS_SCOM1P0R_SCOM1P0_RPA12_Val      _UINT32_(0xA)                                        /* (PPS_SCOM1P0R) RPA12  */
#define   PPS_SCOM1P0R_SCOM1P0_RPB1_Val       _UINT32_(0xB)                                        /* (PPS_SCOM1P0R) RPB1  */
#define   PPS_SCOM1P0R_SCOM1P0_RPB5_Val       _UINT32_(0xC)                                        /* (PPS_SCOM1P0R) RPB5  */
#define   PPS_SCOM1P0R_SCOM1P0_RPB9_Val       _UINT32_(0xD)                                        /* (PPS_SCOM1P0R) RPB9  */
#define   PPS_SCOM1P0R_SCOM1P0_RPB13_Val      _UINT32_(0xE)                                        /* (PPS_SCOM1P0R) RPB13  */
#define   PPS_SCOM1P0R_SCOM1P0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM1P0R) OFF  */
#define PPS_SCOM1P0R_SCOM1P0_RPA1             (PPS_SCOM1P0R_SCOM1P0_RPA1_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPA1 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPA5             (PPS_SCOM1P0R_SCOM1P0_RPA5_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPA5 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPA9             (PPS_SCOM1P0R_SCOM1P0_RPA9_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPA9 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPA13            (PPS_SCOM1P0R_SCOM1P0_RPA13_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPA13 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPB2             (PPS_SCOM1P0R_SCOM1P0_RPB2_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPB2 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPB6             (PPS_SCOM1P0R_SCOM1P0_RPB6_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPB6 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPB10            (PPS_SCOM1P0R_SCOM1P0_RPB10_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPB10 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPA0             (PPS_SCOM1P0R_SCOM1P0_RPA0_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPA0 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPA4             (PPS_SCOM1P0R_SCOM1P0_RPA4_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPA4 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPA8             (PPS_SCOM1P0R_SCOM1P0_RPA8_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPA8 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPA12            (PPS_SCOM1P0R_SCOM1P0_RPA12_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPA12 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPB1             (PPS_SCOM1P0R_SCOM1P0_RPB1_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPB1 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPB5             (PPS_SCOM1P0R_SCOM1P0_RPB5_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPB5 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPB9             (PPS_SCOM1P0R_SCOM1P0_RPB9_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPB9 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPB13            (PPS_SCOM1P0R_SCOM1P0_RPB13_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPB13 Position  */
#define PPS_SCOM1P0R_SCOM1P0_OFF              (PPS_SCOM1P0R_SCOM1P0_OFF_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) OFF Position  */
#define PPS_SCOM1P0R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM1P0R) Register Mask  */


/* -------- PPS_SCOM1P1R : (PPS Offset: 0x54) (R/W 32)  -------- */
#define PPS_SCOM1P1R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM1P1R)   Reset Value */

#define PPS_SCOM1P1R_SCOM1P1_Pos              _UINT32_(0)                                          /* (PPS_SCOM1P1R) SERCOM1/PAD1 Position */
#define PPS_SCOM1P1R_SCOM1P1_Msk              (_UINT32_(0xF) << PPS_SCOM1P1R_SCOM1P1_Pos)          /* (PPS_SCOM1P1R) SERCOM1/PAD1 Mask */
#define PPS_SCOM1P1R_SCOM1P1(value)           (PPS_SCOM1P1R_SCOM1P1_Msk & (_UINT32_(value) << PPS_SCOM1P1R_SCOM1P1_Pos)) /* Assigment of value for SCOM1P1 in the PPS_SCOM1P1R register */
#define   PPS_SCOM1P1R_SCOM1P1_RPA2_Val       _UINT32_(0xF)                                        /* (PPS_SCOM1P1R) RPA2  */
#define   PPS_SCOM1P1R_SCOM1P1_RPA6_Val       _UINT32_(0x1)                                        /* (PPS_SCOM1P1R) RPA6  */
#define   PPS_SCOM1P1R_SCOM1P1_RPA10_Val      _UINT32_(0x2)                                        /* (PPS_SCOM1P1R) RPA10  */
#define   PPS_SCOM1P1R_SCOM1P1_RPA14_Val      _UINT32_(0x3)                                        /* (PPS_SCOM1P1R) RPA14  */
#define   PPS_SCOM1P1R_SCOM1P1_RPB3_Val       _UINT32_(0x4)                                        /* (PPS_SCOM1P1R) RPB3  */
#define   PPS_SCOM1P1R_SCOM1P1_RPB7_Val       _UINT32_(0x5)                                        /* (PPS_SCOM1P1R) RPB7  */
#define   PPS_SCOM1P1R_SCOM1P1_RPB11_Val      _UINT32_(0x6)                                        /* (PPS_SCOM1P1R) RPB11  */
#define   PPS_SCOM1P1R_SCOM1P1_RPA1_Val       _UINT32_(0x7)                                        /* (PPS_SCOM1P1R) RPA1  */
#define   PPS_SCOM1P1R_SCOM1P1_RPA5_Val       _UINT32_(0x8)                                        /* (PPS_SCOM1P1R) RPA5  */
#define   PPS_SCOM1P1R_SCOM1P1_RPA9_Val       _UINT32_(0x9)                                        /* (PPS_SCOM1P1R) RPA9  */
#define   PPS_SCOM1P1R_SCOM1P1_RPA13_Val      _UINT32_(0xA)                                        /* (PPS_SCOM1P1R) RPA13  */
#define   PPS_SCOM1P1R_SCOM1P1_RPB2_Val       _UINT32_(0xB)                                        /* (PPS_SCOM1P1R) RPB2  */
#define   PPS_SCOM1P1R_SCOM1P1_RPB6_Val       _UINT32_(0xC)                                        /* (PPS_SCOM1P1R) RPB6  */
#define   PPS_SCOM1P1R_SCOM1P1_RPB10_Val      _UINT32_(0xD)                                        /* (PPS_SCOM1P1R) RPB10  */
#define   PPS_SCOM1P1R_SCOM1P1_RPA8_Val       _UINT32_(0xE)                                        /* (PPS_SCOM1P1R) RPA8  */
#define   PPS_SCOM1P1R_SCOM1P1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM1P1R) OFF  */
#define PPS_SCOM1P1R_SCOM1P1_RPA2             (PPS_SCOM1P1R_SCOM1P1_RPA2_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPA2 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPA6             (PPS_SCOM1P1R_SCOM1P1_RPA6_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPA6 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPA10            (PPS_SCOM1P1R_SCOM1P1_RPA10_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPA10 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPA14            (PPS_SCOM1P1R_SCOM1P1_RPA14_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPA14 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPB3             (PPS_SCOM1P1R_SCOM1P1_RPB3_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPB3 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPB7             (PPS_SCOM1P1R_SCOM1P1_RPB7_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPB7 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPB11            (PPS_SCOM1P1R_SCOM1P1_RPB11_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPB11 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPA1             (PPS_SCOM1P1R_SCOM1P1_RPA1_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPA1 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPA5             (PPS_SCOM1P1R_SCOM1P1_RPA5_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPA5 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPA9             (PPS_SCOM1P1R_SCOM1P1_RPA9_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPA9 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPA13            (PPS_SCOM1P1R_SCOM1P1_RPA13_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPA13 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPB2             (PPS_SCOM1P1R_SCOM1P1_RPB2_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPB2 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPB6             (PPS_SCOM1P1R_SCOM1P1_RPB6_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPB6 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPB10            (PPS_SCOM1P1R_SCOM1P1_RPB10_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPB10 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPA8             (PPS_SCOM1P1R_SCOM1P1_RPA8_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPA8 Position  */
#define PPS_SCOM1P1R_SCOM1P1_OFF              (PPS_SCOM1P1R_SCOM1P1_OFF_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) OFF Position  */
#define PPS_SCOM1P1R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM1P1R) Register Mask  */


/* -------- PPS_SCOM1P2R : (PPS Offset: 0x58) (R/W 32)  -------- */
#define PPS_SCOM1P2R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM1P2R)   Reset Value */

#define PPS_SCOM1P2R_SCOM1P2_Pos              _UINT32_(0)                                          /* (PPS_SCOM1P2R) SERCOM1/PAD2 Position */
#define PPS_SCOM1P2R_SCOM1P2_Msk              (_UINT32_(0xF) << PPS_SCOM1P2R_SCOM1P2_Pos)          /* (PPS_SCOM1P2R) SERCOM1/PAD2 Mask */
#define PPS_SCOM1P2R_SCOM1P2(value)           (PPS_SCOM1P2R_SCOM1P2_Msk & (_UINT32_(value) << PPS_SCOM1P2R_SCOM1P2_Pos)) /* Assigment of value for SCOM1P2 in the PPS_SCOM1P2R register */
#define   PPS_SCOM1P2R_SCOM1P2_RPA9_Val       _UINT32_(0xF)                                        /* (PPS_SCOM1P2R) RPA9  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA3_Val       _UINT32_(0x1)                                        /* (PPS_SCOM1P2R) RPA3  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA7_Val       _UINT32_(0x2)                                        /* (PPS_SCOM1P2R) RPA7  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA11_Val      _UINT32_(0x3)                                        /* (PPS_SCOM1P2R) RPA11  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB0_Val       _UINT32_(0x4)                                        /* (PPS_SCOM1P2R) RPB0  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB4_Val       _UINT32_(0x5)                                        /* (PPS_SCOM1P2R) RPB4  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB8_Val       _UINT32_(0x6)                                        /* (PPS_SCOM1P2R) RPB8  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB12_Val      _UINT32_(0x7)                                        /* (PPS_SCOM1P2R) RPB12  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA2_Val       _UINT32_(0x8)                                        /* (PPS_SCOM1P2R) RPA2  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA6_Val       _UINT32_(0x9)                                        /* (PPS_SCOM1P2R) RPA6  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA10_Val      _UINT32_(0xA)                                        /* (PPS_SCOM1P2R) RPA10  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA14_Val      _UINT32_(0xB)                                        /* (PPS_SCOM1P2R) RPA14  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB3_Val       _UINT32_(0xC)                                        /* (PPS_SCOM1P2R) RPB3  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB7_Val       _UINT32_(0xD)                                        /* (PPS_SCOM1P2R) RPB7  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB11_Val      _UINT32_(0xE)                                        /* (PPS_SCOM1P2R) RPB11  */
#define   PPS_SCOM1P2R_SCOM1P2_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM1P2R) OFF  */
#define PPS_SCOM1P2R_SCOM1P2_RPA9             (PPS_SCOM1P2R_SCOM1P2_RPA9_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA9 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA3             (PPS_SCOM1P2R_SCOM1P2_RPA3_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA3 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA7             (PPS_SCOM1P2R_SCOM1P2_RPA7_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA7 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA11            (PPS_SCOM1P2R_SCOM1P2_RPA11_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA11 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB0             (PPS_SCOM1P2R_SCOM1P2_RPB0_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB0 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB4             (PPS_SCOM1P2R_SCOM1P2_RPB4_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB4 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB8             (PPS_SCOM1P2R_SCOM1P2_RPB8_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB8 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB12            (PPS_SCOM1P2R_SCOM1P2_RPB12_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB12 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA2             (PPS_SCOM1P2R_SCOM1P2_RPA2_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA2 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA6             (PPS_SCOM1P2R_SCOM1P2_RPA6_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA6 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA10            (PPS_SCOM1P2R_SCOM1P2_RPA10_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA10 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA14            (PPS_SCOM1P2R_SCOM1P2_RPA14_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA14 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB3             (PPS_SCOM1P2R_SCOM1P2_RPB3_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB3 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB7             (PPS_SCOM1P2R_SCOM1P2_RPB7_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB7 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB11            (PPS_SCOM1P2R_SCOM1P2_RPB11_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB11 Position  */
#define PPS_SCOM1P2R_SCOM1P2_OFF              (PPS_SCOM1P2R_SCOM1P2_OFF_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) OFF Position  */
#define PPS_SCOM1P2R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM1P2R) Register Mask  */


/* -------- PPS_SCOM1P3R : (PPS Offset: 0x5C) (R/W 32)  -------- */
#define PPS_SCOM1P3R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM1P3R)   Reset Value */

