Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_rfd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/pps.h
#define PPS_SCOM3P3R_SCOM3P3_Pos              _UINT32_(0)                                          /* (PPS_SCOM3P3R) SERCOM3/PAD3 Position */
#define PPS_SCOM3P3R_SCOM3P3_Msk              (_UINT32_(0xF) << PPS_SCOM3P3R_SCOM3P3_Pos)          /* (PPS_SCOM3P3R) SERCOM3/PAD3 Mask */
#define PPS_SCOM3P3R_SCOM3P3(value)           (PPS_SCOM3P3R_SCOM3P3_Msk & (_UINT32_(value) << PPS_SCOM3P3R_SCOM3P3_Pos)) /* Assigment of value for SCOM3P3 in the PPS_SCOM3P3R register */
#define   PPS_SCOM3P3R_SCOM3P3_RPA2_Val       _UINT32_(0xF)                                        /* (PPS_SCOM3P3R) RPA2  */
#define   PPS_SCOM3P3R_SCOM3P3_RPA6_Val       _UINT32_(0x1)                                        /* (PPS_SCOM3P3R) RPA6  */
#define   PPS_SCOM3P3R_SCOM3P3_RPA10_Val      _UINT32_(0x2)                                        /* (PPS_SCOM3P3R) RPA10  */
#define   PPS_SCOM3P3R_SCOM3P3_RPA14_Val      _UINT32_(0x3)                                        /* (PPS_SCOM3P3R) RPA14  */
#define   PPS_SCOM3P3R_SCOM3P3_RPB3_Val       _UINT32_(0x4)                                        /* (PPS_SCOM3P3R) RPB3  */
#define   PPS_SCOM3P3R_SCOM3P3_RPB7_Val       _UINT32_(0x5)                                        /* (PPS_SCOM3P3R) RPB7  */
#define   PPS_SCOM3P3R_SCOM3P3_RPB11_Val      _UINT32_(0x6)                                        /* (PPS_SCOM3P3R) RPB11  */
#define   PPS_SCOM3P3R_SCOM3P3_RPA1_Val       _UINT32_(0x7)                                        /* (PPS_SCOM3P3R) RPA1  */
#define   PPS_SCOM3P3R_SCOM3P3_RPA5_Val       _UINT32_(0x8)                                        /* (PPS_SCOM3P3R) RPA5  */
#define   PPS_SCOM3P3R_SCOM3P3_RPA9_Val       _UINT32_(0x9)                                        /* (PPS_SCOM3P3R) RPA9  */
#define   PPS_SCOM3P3R_SCOM3P3_RPA13_Val      _UINT32_(0xA)                                        /* (PPS_SCOM3P3R) RPA13  */
#define   PPS_SCOM3P3R_SCOM3P3_RPB2_Val       _UINT32_(0xB)                                        /* (PPS_SCOM3P3R) RPB2  */
#define   PPS_SCOM3P3R_SCOM3P3_RPB6_Val       _UINT32_(0xC)                                        /* (PPS_SCOM3P3R) RPB6  */
#define   PPS_SCOM3P3R_SCOM3P3_RPB10_Val      _UINT32_(0xD)                                        /* (PPS_SCOM3P3R) RPB10  */
#define   PPS_SCOM3P3R_SCOM3P3_RPA8_Val       _UINT32_(0xE)                                        /* (PPS_SCOM3P3R) RPA8  */
#define   PPS_SCOM3P3R_SCOM3P3_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM3P3R) OFF  */
#define PPS_SCOM3P3R_SCOM3P3_RPA2             (PPS_SCOM3P3R_SCOM3P3_RPA2_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) RPA2 Position  */
#define PPS_SCOM3P3R_SCOM3P3_RPA6             (PPS_SCOM3P3R_SCOM3P3_RPA6_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) RPA6 Position  */
#define PPS_SCOM3P3R_SCOM3P3_RPA10            (PPS_SCOM3P3R_SCOM3P3_RPA10_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) RPA10 Position  */
#define PPS_SCOM3P3R_SCOM3P3_RPA14            (PPS_SCOM3P3R_SCOM3P3_RPA14_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) RPA14 Position  */
#define PPS_SCOM3P3R_SCOM3P3_RPB3             (PPS_SCOM3P3R_SCOM3P3_RPB3_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) RPB3 Position  */
#define PPS_SCOM3P3R_SCOM3P3_RPB7             (PPS_SCOM3P3R_SCOM3P3_RPB7_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) RPB7 Position  */
#define PPS_SCOM3P3R_SCOM3P3_RPB11            (PPS_SCOM3P3R_SCOM3P3_RPB11_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) RPB11 Position  */
#define PPS_SCOM3P3R_SCOM3P3_RPA1             (PPS_SCOM3P3R_SCOM3P3_RPA1_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) RPA1 Position  */
#define PPS_SCOM3P3R_SCOM3P3_RPA5             (PPS_SCOM3P3R_SCOM3P3_RPA5_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) RPA5 Position  */
#define PPS_SCOM3P3R_SCOM3P3_RPA9             (PPS_SCOM3P3R_SCOM3P3_RPA9_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) RPA9 Position  */
#define PPS_SCOM3P3R_SCOM3P3_RPA13            (PPS_SCOM3P3R_SCOM3P3_RPA13_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) RPA13 Position  */
#define PPS_SCOM3P3R_SCOM3P3_RPB2             (PPS_SCOM3P3R_SCOM3P3_RPB2_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) RPB2 Position  */
#define PPS_SCOM3P3R_SCOM3P3_RPB6             (PPS_SCOM3P3R_SCOM3P3_RPB6_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) RPB6 Position  */
#define PPS_SCOM3P3R_SCOM3P3_RPB10            (PPS_SCOM3P3R_SCOM3P3_RPB10_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) RPB10 Position  */
#define PPS_SCOM3P3R_SCOM3P3_RPA8             (PPS_SCOM3P3R_SCOM3P3_RPA8_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) RPA8 Position  */
#define PPS_SCOM3P3R_SCOM3P3_OFF              (PPS_SCOM3P3R_SCOM3P3_OFF_Val << PPS_SCOM3P3R_SCOM3P3_Pos) /* (PPS_SCOM3P3R) OFF Position  */
#define PPS_SCOM3P3R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM3P3R) Register Mask  */


/* -------- PPS_QSCKR : (PPS Offset: 0x80) (R/W 32)  -------- */
#define PPS_QSCKR_RESETVALUE                  _UINT32_(0x00)                                       /*  (PPS_QSCKR)   Reset Value */

#define PPS_QSCKR_QSCK_Pos                    _UINT32_(0)                                          /* (PPS_QSCKR) QSPI/SCK Position */
#define PPS_QSCKR_QSCK_Msk                    (_UINT32_(0xF) << PPS_QSCKR_QSCK_Pos)                /* (PPS_QSCKR) QSPI/SCK Mask */
#define PPS_QSCKR_QSCK(value)                 (PPS_QSCKR_QSCK_Msk & (_UINT32_(value) << PPS_QSCKR_QSCK_Pos)) /* Assigment of value for QSCK in the PPS_QSCKR register */
#define   PPS_QSCKR_QSCK_RPA9_Val             _UINT32_(0xF)                                        /* (PPS_QSCKR) RPA9  */
#define   PPS_QSCKR_QSCK_RPA3_Val             _UINT32_(0x1)                                        /* (PPS_QSCKR) RPA3  */
#define   PPS_QSCKR_QSCK_RPA7_Val             _UINT32_(0x2)                                        /* (PPS_QSCKR) RPA7  */
#define   PPS_QSCKR_QSCK_RPA11_Val            _UINT32_(0x3)                                        /* (PPS_QSCKR) RPA11  */
#define   PPS_QSCKR_QSCK_RPB0_Val             _UINT32_(0x4)                                        /* (PPS_QSCKR) RPB0  */
#define   PPS_QSCKR_QSCK_RPB4_Val             _UINT32_(0x5)                                        /* (PPS_QSCKR) RPB4  */
#define   PPS_QSCKR_QSCK_RPB8_Val             _UINT32_(0x6)                                        /* (PPS_QSCKR) RPB8  */
#define   PPS_QSCKR_QSCK_RPB12_Val            _UINT32_(0x7)                                        /* (PPS_QSCKR) RPB12  */
#define   PPS_QSCKR_QSCK_RPA2_Val             _UINT32_(0x8)                                        /* (PPS_QSCKR) RPA2  */
#define   PPS_QSCKR_QSCK_RPA6_Val             _UINT32_(0x9)                                        /* (PPS_QSCKR) RPA6  */
#define   PPS_QSCKR_QSCK_RPA10_Val            _UINT32_(0xA)                                        /* (PPS_QSCKR) RPA10  */
#define   PPS_QSCKR_QSCK_RPA14_Val            _UINT32_(0xB)                                        /* (PPS_QSCKR) RPA14  */
#define   PPS_QSCKR_QSCK_RPB3_Val             _UINT32_(0xC)                                        /* (PPS_QSCKR) RPB3  */
#define   PPS_QSCKR_QSCK_RPB7_Val             _UINT32_(0xD)                                        /* (PPS_QSCKR) RPB7  */
#define   PPS_QSCKR_QSCK_RPB11_Val            _UINT32_(0xE)                                        /* (PPS_QSCKR) RPB11  */
#define   PPS_QSCKR_QSCK_OFF_Val              _UINT32_(0x0)                                        /* (PPS_QSCKR) OFF  */
#define PPS_QSCKR_QSCK_RPA9                   (PPS_QSCKR_QSCK_RPA9_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPA9 Position  */
#define PPS_QSCKR_QSCK_RPA3                   (PPS_QSCKR_QSCK_RPA3_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPA3 Position  */
#define PPS_QSCKR_QSCK_RPA7                   (PPS_QSCKR_QSCK_RPA7_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPA7 Position  */
#define PPS_QSCKR_QSCK_RPA11                  (PPS_QSCKR_QSCK_RPA11_Val << PPS_QSCKR_QSCK_Pos)     /* (PPS_QSCKR) RPA11 Position  */
#define PPS_QSCKR_QSCK_RPB0                   (PPS_QSCKR_QSCK_RPB0_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPB0 Position  */
#define PPS_QSCKR_QSCK_RPB4                   (PPS_QSCKR_QSCK_RPB4_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPB4 Position  */
#define PPS_QSCKR_QSCK_RPB8                   (PPS_QSCKR_QSCK_RPB8_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPB8 Position  */
#define PPS_QSCKR_QSCK_RPB12                  (PPS_QSCKR_QSCK_RPB12_Val << PPS_QSCKR_QSCK_Pos)     /* (PPS_QSCKR) RPB12 Position  */
#define PPS_QSCKR_QSCK_RPA2                   (PPS_QSCKR_QSCK_RPA2_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPA2 Position  */
#define PPS_QSCKR_QSCK_RPA6                   (PPS_QSCKR_QSCK_RPA6_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPA6 Position  */
#define PPS_QSCKR_QSCK_RPA10                  (PPS_QSCKR_QSCK_RPA10_Val << PPS_QSCKR_QSCK_Pos)     /* (PPS_QSCKR) RPA10 Position  */
#define PPS_QSCKR_QSCK_RPA14                  (PPS_QSCKR_QSCK_RPA14_Val << PPS_QSCKR_QSCK_Pos)     /* (PPS_QSCKR) RPA14 Position  */
#define PPS_QSCKR_QSCK_RPB3                   (PPS_QSCKR_QSCK_RPB3_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPB3 Position  */
#define PPS_QSCKR_QSCK_RPB7                   (PPS_QSCKR_QSCK_RPB7_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPB7 Position  */
#define PPS_QSCKR_QSCK_RPB11                  (PPS_QSCKR_QSCK_RPB11_Val << PPS_QSCKR_QSCK_Pos)     /* (PPS_QSCKR) RPB11 Position  */
#define PPS_QSCKR_QSCK_OFF                    (PPS_QSCKR_QSCK_OFF_Val << PPS_QSCKR_QSCK_Pos)       /* (PPS_QSCKR) OFF Position  */
#define PPS_QSCKR_Msk                         _UINT32_(0x0000000F)                                 /* (PPS_QSCKR) Register Mask  */


