Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_rfd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/pps.h
#define PPS_TC3WO1G4R_TC3WO1_Pos              _UINT32_(0)                                          /* (PPS_TC3WO1G4R) TC3/WO1G4 Position */
#define PPS_TC3WO1G4R_TC3WO1_Msk              (_UINT32_(0xF) << PPS_TC3WO1G4R_TC3WO1_Pos)          /* (PPS_TC3WO1G4R) TC3/WO1G4 Mask */
#define PPS_TC3WO1G4R_TC3WO1(value)           (PPS_TC3WO1G4R_TC3WO1_Msk & (_UINT32_(value) << PPS_TC3WO1G4R_TC3WO1_Pos)) /* Assigment of value for TC3WO1 in the PPS_TC3WO1G4R register */
#define   PPS_TC3WO1G4R_TC3WO1_RPA2_Val       _UINT32_(0xF)                                        /* (PPS_TC3WO1G4R) RPA2  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA6_Val       _UINT32_(0x1)                                        /* (PPS_TC3WO1G4R) RPA6  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA10_Val      _UINT32_(0x2)                                        /* (PPS_TC3WO1G4R) RPA10  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA14_Val      _UINT32_(0x3)                                        /* (PPS_TC3WO1G4R) RPA14  */
#define   PPS_TC3WO1G4R_TC3WO1_RPB3_Val       _UINT32_(0x4)                                        /* (PPS_TC3WO1G4R) RPB3  */
#define   PPS_TC3WO1G4R_TC3WO1_RPB7_Val       _UINT32_(0x5)                                        /* (PPS_TC3WO1G4R) RPB7  */
#define   PPS_TC3WO1G4R_TC3WO1_RPB11_Val      _UINT32_(0x6)                                        /* (PPS_TC3WO1G4R) RPB11  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA1_Val       _UINT32_(0x7)                                        /* (PPS_TC3WO1G4R) RPA1  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA5_Val       _UINT32_(0x8)                                        /* (PPS_TC3WO1G4R) RPA5  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA9_Val       _UINT32_(0x9)                                        /* (PPS_TC3WO1G4R) RPA9  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA13_Val      _UINT32_(0xA)                                        /* (PPS_TC3WO1G4R) RPA13  */
#define   PPS_TC3WO1G4R_TC3WO1_RPB2_Val       _UINT32_(0xB)                                        /* (PPS_TC3WO1G4R) RPB2  */
#define   PPS_TC3WO1G4R_TC3WO1_RPB6_Val       _UINT32_(0xC)                                        /* (PPS_TC3WO1G4R) RPB6  */
#define   PPS_TC3WO1G4R_TC3WO1_RPB10_Val      _UINT32_(0xD)                                        /* (PPS_TC3WO1G4R) RPB10  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA8_Val       _UINT32_(0xE)                                        /* (PPS_TC3WO1G4R) RPA8  */
#define   PPS_TC3WO1G4R_TC3WO1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC3WO1G4R) OFF  */
#define PPS_TC3WO1G4R_TC3WO1_RPA2             (PPS_TC3WO1G4R_TC3WO1_RPA2_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA2 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA6             (PPS_TC3WO1G4R_TC3WO1_RPA6_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA6 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA10            (PPS_TC3WO1G4R_TC3WO1_RPA10_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA10 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA14            (PPS_TC3WO1G4R_TC3WO1_RPA14_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA14 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPB3             (PPS_TC3WO1G4R_TC3WO1_RPB3_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPB3 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPB7             (PPS_TC3WO1G4R_TC3WO1_RPB7_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPB7 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPB11            (PPS_TC3WO1G4R_TC3WO1_RPB11_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPB11 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA1             (PPS_TC3WO1G4R_TC3WO1_RPA1_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA1 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA5             (PPS_TC3WO1G4R_TC3WO1_RPA5_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA5 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA9             (PPS_TC3WO1G4R_TC3WO1_RPA9_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA9 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA13            (PPS_TC3WO1G4R_TC3WO1_RPA13_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA13 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPB2             (PPS_TC3WO1G4R_TC3WO1_RPB2_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPB2 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPB6             (PPS_TC3WO1G4R_TC3WO1_RPB6_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPB6 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPB10            (PPS_TC3WO1G4R_TC3WO1_RPB10_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPB10 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA8             (PPS_TC3WO1G4R_TC3WO1_RPA8_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA8 Position  */
#define PPS_TC3WO1G4R_TC3WO1_OFF              (PPS_TC3WO1G4R_TC3WO1_OFF_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) OFF Position  */
#define PPS_TC3WO1G4R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC3WO1G4R) Register Mask  */


/* -------- PPS_RPA0G2R : (PPS Offset: 0x200) (R/W 32)  -------- */
#define PPS_RPA0G2R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPA0G2R)   Reset Value */

#define PPS_RPA0G2R_RPA0G2R_Pos               _UINT32_(0)                                          /* (PPS_RPA0G2R) RPA0/G2 Position */
#define PPS_RPA0G2R_RPA0G2R_Msk               (_UINT32_(0x1F) << PPS_RPA0G2R_RPA0G2R_Pos)          /* (PPS_RPA0G2R) RPA0/G2 Mask */
#define PPS_RPA0G2R_RPA0G2R(value)            (PPS_RPA0G2R_RPA0G2R_Msk & (_UINT32_(value) << PPS_RPA0G2R_RPA0G2R_Pos)) /* Assigment of value for RPA0G2R in the PPS_RPA0G2R register */
#define   PPS_RPA0G2R_RPA0G2R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPA0G2R) OFF  */
#define   PPS_RPA0G2R_RPA0G2R_SCOM0P0_Val     _UINT32_(0x1)                                        /* (PPS_RPA0G2R) SERCOM0/PAD0  */
#define   PPS_RPA0G2R_RPA0G2R_SCOM0P3_Val     _UINT32_(0x2)                                        /* (PPS_RPA0G2R) SERCOM0/PAD3  */
#define   PPS_RPA0G2R_RPA0G2R_SCOM0P2_Val     _UINT32_(0x3)                                        /* (PPS_RPA0G2R) SERCOM0/PAD2  */
#define   PPS_RPA0G2R_RPA0G2R_SCOM1P1_Val     _UINT32_(0x4)                                        /* (PPS_RPA0G2R) SERCOM1/PAD1  */
#define   PPS_RPA0G2R_RPA0G2R_SCOM1P3_Val     _UINT32_(0x5)                                        /* (PPS_RPA0G2R) SERCOM1/PAD3  */
#define   PPS_RPA0G2R_RPA0G2R_SCOM1P2_Val     _UINT32_(0x6)                                        /* (PPS_RPA0G2R) SERCOM1/PAD2  */
#define   PPS_RPA0G2R_RPA0G2R_SCOM2P1_Val     _UINT32_(0x7)                                        /* (PPS_RPA0G2R) SERCOM2/PAD1  */
#define   PPS_RPA0G2R_RPA0G2R_SCOM2P2_Val     _UINT32_(0x8)                                        /* (PPS_RPA0G2R) SERCOM2/PAD2  */
#define   PPS_RPA0G2R_RPA0G2R_SCOM3P1_Val     _UINT32_(0x9)                                        /* (PPS_RPA0G2R) SERCOM3/PAD1  */
#define   PPS_RPA0G2R_RPA0G2R_SCOM3P0_Val     _UINT32_(0xA)                                        /* (PPS_RPA0G2R) SERCOM3/PAD0  */
#define   PPS_RPA0G2R_RPA0G2R_TCC0WO1_Val     _UINT32_(0xB)                                        /* (PPS_RPA0G2R) TCC0/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_TCC0WO5_Val     _UINT32_(0xC)                                        /* (PPS_RPA0G2R) TCC0/WO5  */
#define   PPS_RPA0G2R_RPA0G2R_TCC0WO3_Val     _UINT32_(0xD)                                        /* (PPS_RPA0G2R) TCC0/WO3  */
#define   PPS_RPA0G2R_RPA0G2R_TCC1WO1_Val     _UINT32_(0xE)                                        /* (PPS_RPA0G2R) TCC1/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_TCC1WO5_Val     _UINT32_(0xF)                                        /* (PPS_RPA0G2R) TCC1/WO5  */
#define   PPS_RPA0G2R_RPA0G2R_TCC1WO3_Val     _UINT32_(0x10)                                       /* (PPS_RPA0G2R) TCC1/WO3  */
#define   PPS_RPA0G2R_RPA0G2R_TCC2WO1_Val     _UINT32_(0x11)                                       /* (PPS_RPA0G2R) TCC2/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_TC0WO1_Val      _UINT32_(0x12)                                       /* (PPS_RPA0G2R) TC0/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_REFO2_Val       _UINT32_(0x13)                                       /* (PPS_RPA0G2R) REFO2  */
#define   PPS_RPA0G2R_RPA0G2R_TC1WO1_Val      _UINT32_(0x14)                                       /* (PPS_RPA0G2R) TC1/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_TC2WO1_Val      _UINT32_(0x15)                                       /* (PPS_RPA0G2R) TC2/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_TC3WO1_Val      _UINT32_(0x16)                                       /* (PPS_RPA0G2R) TC3/WO1  */
#define   PPS_RPA0G2R_RPA0G2R_QSCK_Val        _UINT32_(0x17)                                       /* (PPS_RPA0G2R) QSCK  */
#define   PPS_RPA0G2R_RPA0G2R_QCS_Val         _UINT32_(0x18)                                       /* (PPS_RPA0G2R) QCS  */
#define   PPS_RPA0G2R_RPA0G2R_QD0_Val         _UINT32_(0x19)                                       /* (PPS_RPA0G2R) QD0  */
#define   PPS_RPA0G2R_RPA0G2R_QD3_Val         _UINT32_(0x1A)                                       /* (PPS_RPA0G2R) QD3  */
#define   PPS_RPA0G2R_RPA0G2R_QD2_Val         _UINT32_(0x1B)                                       /* (PPS_RPA0G2R) QD2  */
#define   PPS_RPA0G2R_RPA0G2R_CCLOUT1_Val     _UINT32_(0x1C)                                       /* (PPS_RPA0G2R) CCLOUT1  */
#define   PPS_RPA0G2R_RPA0G2R_TSTBUS1_Val     _UINT32_(0x1D)                                       /* (PPS_RPA0G2R) TSTBUS1  */
#define   PPS_RPA0G2R_RPA0G2R_TSTBUS5_Val     _UINT32_(0x1E)                                       /* (PPS_RPA0G2R) TSTBUS5  */
#define   PPS_RPA0G2R_RPA0G2R_TSTBUS9_Val     _UINT32_(0x1F)                                       /* (PPS_RPA0G2R) TSTBUS9  */
#define PPS_RPA0G2R_RPA0G2R_OFF               (PPS_RPA0G2R_RPA0G2R_OFF_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) OFF Position  */
#define PPS_RPA0G2R_RPA0G2R_SCOM0P0           (PPS_RPA0G2R_RPA0G2R_SCOM0P0_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) SERCOM0/PAD0 Position  */
#define PPS_RPA0G2R_RPA0G2R_SCOM0P3           (PPS_RPA0G2R_RPA0G2R_SCOM0P3_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) SERCOM0/PAD3 Position  */
#define PPS_RPA0G2R_RPA0G2R_SCOM0P2           (PPS_RPA0G2R_RPA0G2R_SCOM0P2_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) SERCOM0/PAD2 Position  */
#define PPS_RPA0G2R_RPA0G2R_SCOM1P1           (PPS_RPA0G2R_RPA0G2R_SCOM1P1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) SERCOM1/PAD1 Position  */
#define PPS_RPA0G2R_RPA0G2R_SCOM1P3           (PPS_RPA0G2R_RPA0G2R_SCOM1P3_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) SERCOM1/PAD3 Position  */
#define PPS_RPA0G2R_RPA0G2R_SCOM1P2           (PPS_RPA0G2R_RPA0G2R_SCOM1P2_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) SERCOM1/PAD2 Position  */
#define PPS_RPA0G2R_RPA0G2R_SCOM2P1           (PPS_RPA0G2R_RPA0G2R_SCOM2P1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) SERCOM2/PAD1 Position  */
#define PPS_RPA0G2R_RPA0G2R_SCOM2P2           (PPS_RPA0G2R_RPA0G2R_SCOM2P2_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) SERCOM2/PAD2 Position  */
#define PPS_RPA0G2R_RPA0G2R_SCOM3P1           (PPS_RPA0G2R_RPA0G2R_SCOM3P1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) SERCOM3/PAD1 Position  */
#define PPS_RPA0G2R_RPA0G2R_SCOM3P0           (PPS_RPA0G2R_RPA0G2R_SCOM3P0_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) SERCOM3/PAD0 Position  */
#define PPS_RPA0G2R_RPA0G2R_TCC0WO1           (PPS_RPA0G2R_RPA0G2R_TCC0WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TCC0/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TCC0WO5           (PPS_RPA0G2R_RPA0G2R_TCC0WO5_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TCC0/WO5 Position  */
#define PPS_RPA0G2R_RPA0G2R_TCC0WO3           (PPS_RPA0G2R_RPA0G2R_TCC0WO3_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TCC0/WO3 Position  */
#define PPS_RPA0G2R_RPA0G2R_TCC1WO1           (PPS_RPA0G2R_RPA0G2R_TCC1WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TCC1/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TCC1WO5           (PPS_RPA0G2R_RPA0G2R_TCC1WO5_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TCC1/WO5 Position  */
#define PPS_RPA0G2R_RPA0G2R_TCC1WO3           (PPS_RPA0G2R_RPA0G2R_TCC1WO3_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TCC1/WO3 Position  */
#define PPS_RPA0G2R_RPA0G2R_TCC2WO1           (PPS_RPA0G2R_RPA0G2R_TCC2WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TCC2/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TC0WO1            (PPS_RPA0G2R_RPA0G2R_TC0WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TC0/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_REFO2             (PPS_RPA0G2R_RPA0G2R_REFO2_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) REFO2 Position  */
#define PPS_RPA0G2R_RPA0G2R_TC1WO1            (PPS_RPA0G2R_RPA0G2R_TC1WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TC1/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TC2WO1            (PPS_RPA0G2R_RPA0G2R_TC2WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TC2/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TC3WO1            (PPS_RPA0G2R_RPA0G2R_TC3WO1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TC3/WO1 Position  */
#define PPS_RPA0G2R_RPA0G2R_QSCK              (PPS_RPA0G2R_RPA0G2R_QSCK_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) QSCK Position  */
#define PPS_RPA0G2R_RPA0G2R_QCS               (PPS_RPA0G2R_RPA0G2R_QCS_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) QCS Position  */
#define PPS_RPA0G2R_RPA0G2R_QD0               (PPS_RPA0G2R_RPA0G2R_QD0_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) QD0 Position  */
#define PPS_RPA0G2R_RPA0G2R_QD3               (PPS_RPA0G2R_RPA0G2R_QD3_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) QD3 Position  */
#define PPS_RPA0G2R_RPA0G2R_QD2               (PPS_RPA0G2R_RPA0G2R_QD2_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) QD2 Position  */
#define PPS_RPA0G2R_RPA0G2R_CCLOUT1           (PPS_RPA0G2R_RPA0G2R_CCLOUT1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) CCLOUT1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TSTBUS1           (PPS_RPA0G2R_RPA0G2R_TSTBUS1_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TSTBUS1 Position  */
#define PPS_RPA0G2R_RPA0G2R_TSTBUS5           (PPS_RPA0G2R_RPA0G2R_TSTBUS5_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TSTBUS5 Position  */
#define PPS_RPA0G2R_RPA0G2R_TSTBUS9           (PPS_RPA0G2R_RPA0G2R_TSTBUS9_Val << PPS_RPA0G2R_RPA0G2R_Pos) /* (PPS_RPA0G2R) TSTBUS9 Position  */
#define PPS_RPA0G2R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_RPA0G2R) Register Mask  */


/* -------- PPS_RPA0G3R : (PPS Offset: 0x204) (R/W 32)  -------- */
#define PPS_RPA0G3R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPA0G3R)   Reset Value */

