Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_rfd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/pps.h
/* -------- PPS_RPA3G1R : (PPS Offset: 0x218) (R/W 32)  -------- */
#define PPS_RPA3G1R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPA3G1R)   Reset Value */

#define PPS_RPA3G1R_RPA3G1R_Pos               _UINT32_(0)                                          /* (PPS_RPA3G1R) RPA3/G1 Position */
#define PPS_RPA3G1R_RPA3G1R_Msk               (_UINT32_(0x1F) << PPS_RPA3G1R_RPA3G1R_Pos)          /* (PPS_RPA3G1R) RPA3/G1 Mask */
#define PPS_RPA3G1R_RPA3G1R(value)            (PPS_RPA3G1R_RPA3G1R_Msk & (_UINT32_(value) << PPS_RPA3G1R_RPA3G1R_Pos)) /* Assigment of value for RPA3G1R in the PPS_RPA3G1R register */
#define   PPS_RPA3G1R_RPA3G1R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPA3G1R) OFF  */
#define   PPS_RPA3G1R_RPA3G1R_SCOM0P3_Val     _UINT32_(0x1)                                        /* (PPS_RPA3G1R) SERCOM0/PAD3  */
#define   PPS_RPA3G1R_RPA3G1R_SCOM0P2_Val     _UINT32_(0x2)                                        /* (PPS_RPA3G1R) SERCOM0/PAD2  */
#define   PPS_RPA3G1R_RPA3G1R_SCOM0P1_Val     _UINT32_(0x3)                                        /* (PPS_RPA3G1R) SERCOM0/PAD1  */
#define   PPS_RPA3G1R_RPA3G1R_SCOM1P0_Val     _UINT32_(0x4)                                        /* (PPS_RPA3G1R) SERCOM1/PAD0  */
#define   PPS_RPA3G1R_RPA3G1R_SCOM1P2_Val     _UINT32_(0x5)                                        /* (PPS_RPA3G1R) SERCOM1/PAD2  */
#define   PPS_RPA3G1R_RPA3G1R_SCOM1P1_Val     _UINT32_(0x6)                                        /* (PPS_RPA3G1R) SERCOM1/PAD1  */
#define   PPS_RPA3G1R_RPA3G1R_SCOM2P0_Val     _UINT32_(0x7)                                        /* (PPS_RPA3G1R) SERCOM2/PAD0  */
#define   PPS_RPA3G1R_RPA3G1R_SCOM2P1_Val     _UINT32_(0x8)                                        /* (PPS_RPA3G1R) SERCOM2/PAD1  */
#define   PPS_RPA3G1R_RPA3G1R_SCOM3P0_Val     _UINT32_(0x9)                                        /* (PPS_RPA3G1R) SERCOM3/PAD0  */
#define   PPS_RPA3G1R_RPA3G1R_SCOM3P3_Val     _UINT32_(0xA)                                        /* (PPS_RPA3G1R) SERCOM3/PAD3  */
#define   PPS_RPA3G1R_RPA3G1R_TCC0WO0_Val     _UINT32_(0xB)                                        /* (PPS_RPA3G1R) TCC0/WO0  */
#define   PPS_RPA3G1R_RPA3G1R_TCC0WO4_Val     _UINT32_(0xC)                                        /* (PPS_RPA3G1R) TCC0/WO4  */
#define   PPS_RPA3G1R_RPA3G1R_TCC0WO2_Val     _UINT32_(0xD)                                        /* (PPS_RPA3G1R) TCC0/WO2  */
#define   PPS_RPA3G1R_RPA3G1R_TCC1WO0_Val     _UINT32_(0xE)                                        /* (PPS_RPA3G1R) TCC1/WO0  */
#define   PPS_RPA3G1R_RPA3G1R_TCC1WO4_Val     _UINT32_(0xF)                                        /* (PPS_RPA3G1R) TCC1/WO4  */
#define   PPS_RPA3G1R_RPA3G1R_TCC1WO2_Val     _UINT32_(0x10)                                       /* (PPS_RPA3G1R) TCC1/WO2  */
#define   PPS_RPA3G1R_RPA3G1R_TCC2WO0_Val     _UINT32_(0x11)                                       /* (PPS_RPA3G1R) TCC2/WO0  */
#define   PPS_RPA3G1R_RPA3G1R_TC0WO1_Val      _UINT32_(0x12)                                       /* (PPS_RPA3G1R) TC0/WO1  */
#define   PPS_RPA3G1R_RPA3G1R_REFO1_Val       _UINT32_(0x13)                                       /* (PPS_RPA3G1R) REFO1  */
#define   PPS_RPA3G1R_RPA3G1R_TC1WO0_Val      _UINT32_(0x14)                                       /* (PPS_RPA3G1R) TC1/WO0  */
#define   PPS_RPA3G1R_RPA3G1R_TC2WO0_Val      _UINT32_(0x15)                                       /* (PPS_RPA3G1R) TC2/WO0  */
#define   PPS_RPA3G1R_RPA3G1R_TC3WO0_Val      _UINT32_(0x16)                                       /* (PPS_RPA3G1R) TC3/WO0  */
#define   PPS_RPA3G1R_RPA3G1R_QSCK_Val        _UINT32_(0x17)                                       /* (PPS_RPA3G1R) QSCK  */
#define   PPS_RPA3G1R_RPA3G1R_QCS_Val         _UINT32_(0x18)                                       /* (PPS_RPA3G1R) QCS  */
#define   PPS_RPA3G1R_RPA3G1R_QD3_Val         _UINT32_(0x19)                                       /* (PPS_RPA3G1R) QD3  */
#define   PPS_RPA3G1R_RPA3G1R_QD2_Val         _UINT32_(0x1A)                                       /* (PPS_RPA3G1R) QD2  */
#define   PPS_RPA3G1R_RPA3G1R_QD1_Val         _UINT32_(0x1B)                                       /* (PPS_RPA3G1R) QD1  */
#define   PPS_RPA3G1R_RPA3G1R_CCLOUT0_Val     _UINT32_(0x1C)                                       /* (PPS_RPA3G1R) CCLOUT0  */
#define   PPS_RPA3G1R_RPA3G1R_TSTBUS0_Val     _UINT32_(0x1D)                                       /* (PPS_RPA3G1R) TSTBUS0  */
#define   PPS_RPA3G1R_RPA3G1R_TSTBUS4_Val     _UINT32_(0x1E)                                       /* (PPS_RPA3G1R) TSTBUS4  */
#define   PPS_RPA3G1R_RPA3G1R_TSTBUS8_Val     _UINT32_(0x1F)                                       /* (PPS_RPA3G1R) TSTBUS8  */
#define PPS_RPA3G1R_RPA3G1R_OFF               (PPS_RPA3G1R_RPA3G1R_OFF_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) OFF Position  */
#define PPS_RPA3G1R_RPA3G1R_SCOM0P3           (PPS_RPA3G1R_RPA3G1R_SCOM0P3_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) SERCOM0/PAD3 Position  */
#define PPS_RPA3G1R_RPA3G1R_SCOM0P2           (PPS_RPA3G1R_RPA3G1R_SCOM0P2_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) SERCOM0/PAD2 Position  */
#define PPS_RPA3G1R_RPA3G1R_SCOM0P1           (PPS_RPA3G1R_RPA3G1R_SCOM0P1_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) SERCOM0/PAD1 Position  */
#define PPS_RPA3G1R_RPA3G1R_SCOM1P0           (PPS_RPA3G1R_RPA3G1R_SCOM1P0_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) SERCOM1/PAD0 Position  */
#define PPS_RPA3G1R_RPA3G1R_SCOM1P2           (PPS_RPA3G1R_RPA3G1R_SCOM1P2_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) SERCOM1/PAD2 Position  */
#define PPS_RPA3G1R_RPA3G1R_SCOM1P1           (PPS_RPA3G1R_RPA3G1R_SCOM1P1_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) SERCOM1/PAD1 Position  */
#define PPS_RPA3G1R_RPA3G1R_SCOM2P0           (PPS_RPA3G1R_RPA3G1R_SCOM2P0_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) SERCOM2/PAD0 Position  */
#define PPS_RPA3G1R_RPA3G1R_SCOM2P1           (PPS_RPA3G1R_RPA3G1R_SCOM2P1_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) SERCOM2/PAD1 Position  */
#define PPS_RPA3G1R_RPA3G1R_SCOM3P0           (PPS_RPA3G1R_RPA3G1R_SCOM3P0_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) SERCOM3/PAD0 Position  */
#define PPS_RPA3G1R_RPA3G1R_SCOM3P3           (PPS_RPA3G1R_RPA3G1R_SCOM3P3_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) SERCOM3/PAD3 Position  */
#define PPS_RPA3G1R_RPA3G1R_TCC0WO0           (PPS_RPA3G1R_RPA3G1R_TCC0WO0_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) TCC0/WO0 Position  */
#define PPS_RPA3G1R_RPA3G1R_TCC0WO4           (PPS_RPA3G1R_RPA3G1R_TCC0WO4_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) TCC0/WO4 Position  */
#define PPS_RPA3G1R_RPA3G1R_TCC0WO2           (PPS_RPA3G1R_RPA3G1R_TCC0WO2_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) TCC0/WO2 Position  */
#define PPS_RPA3G1R_RPA3G1R_TCC1WO0           (PPS_RPA3G1R_RPA3G1R_TCC1WO0_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) TCC1/WO0 Position  */
#define PPS_RPA3G1R_RPA3G1R_TCC1WO4           (PPS_RPA3G1R_RPA3G1R_TCC1WO4_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) TCC1/WO4 Position  */
#define PPS_RPA3G1R_RPA3G1R_TCC1WO2           (PPS_RPA3G1R_RPA3G1R_TCC1WO2_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) TCC1/WO2 Position  */
#define PPS_RPA3G1R_RPA3G1R_TCC2WO0           (PPS_RPA3G1R_RPA3G1R_TCC2WO0_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) TCC2/WO0 Position  */
#define PPS_RPA3G1R_RPA3G1R_TC0WO1            (PPS_RPA3G1R_RPA3G1R_TC0WO1_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) TC0/WO1 Position  */
#define PPS_RPA3G1R_RPA3G1R_REFO1             (PPS_RPA3G1R_RPA3G1R_REFO1_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) REFO1 Position  */
#define PPS_RPA3G1R_RPA3G1R_TC1WO0            (PPS_RPA3G1R_RPA3G1R_TC1WO0_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) TC1/WO0 Position  */
#define PPS_RPA3G1R_RPA3G1R_TC2WO0            (PPS_RPA3G1R_RPA3G1R_TC2WO0_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) TC2/WO0 Position  */
#define PPS_RPA3G1R_RPA3G1R_TC3WO0            (PPS_RPA3G1R_RPA3G1R_TC3WO0_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) TC3/WO0 Position  */
#define PPS_RPA3G1R_RPA3G1R_QSCK              (PPS_RPA3G1R_RPA3G1R_QSCK_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) QSCK Position  */
#define PPS_RPA3G1R_RPA3G1R_QCS               (PPS_RPA3G1R_RPA3G1R_QCS_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) QCS Position  */
#define PPS_RPA3G1R_RPA3G1R_QD3               (PPS_RPA3G1R_RPA3G1R_QD3_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) QD3 Position  */
#define PPS_RPA3G1R_RPA3G1R_QD2               (PPS_RPA3G1R_RPA3G1R_QD2_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) QD2 Position  */
#define PPS_RPA3G1R_RPA3G1R_QD1               (PPS_RPA3G1R_RPA3G1R_QD1_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) QD1 Position  */
#define PPS_RPA3G1R_RPA3G1R_CCLOUT0           (PPS_RPA3G1R_RPA3G1R_CCLOUT0_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) CCLOUT0 Position  */
#define PPS_RPA3G1R_RPA3G1R_TSTBUS0           (PPS_RPA3G1R_RPA3G1R_TSTBUS0_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) TSTBUS0 Position  */
#define PPS_RPA3G1R_RPA3G1R_TSTBUS4           (PPS_RPA3G1R_RPA3G1R_TSTBUS4_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) TSTBUS4 Position  */
#define PPS_RPA3G1R_RPA3G1R_TSTBUS8           (PPS_RPA3G1R_RPA3G1R_TSTBUS8_Val << PPS_RPA3G1R_RPA3G1R_Pos) /* (PPS_RPA3G1R) TSTBUS8 Position  */
#define PPS_RPA3G1R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_RPA3G1R) Register Mask  */


/* -------- PPS_RPA3G2R : (PPS Offset: 0x21C) (R/W 32)  -------- */
#define PPS_RPA3G2R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPA3G2R)   Reset Value */

#define PPS_RPA3G2R_RPA3G2R_Pos               _UINT32_(0)                                          /* (PPS_RPA3G2R) RPA3/G2 Position */
#define PPS_RPA3G2R_RPA3G2R_Msk               (_UINT32_(0x1F) << PPS_RPA3G2R_RPA3G2R_Pos)          /* (PPS_RPA3G2R) RPA3/G2 Mask */
#define PPS_RPA3G2R_RPA3G2R(value)            (PPS_RPA3G2R_RPA3G2R_Msk & (_UINT32_(value) << PPS_RPA3G2R_RPA3G2R_Pos)) /* Assigment of value for RPA3G2R in the PPS_RPA3G2R register */
#define   PPS_RPA3G2R_RPA3G2R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPA3G2R) OFF  */
#define   PPS_RPA3G2R_RPA3G2R_SCOM0P0_Val     _UINT32_(0x1)                                        /* (PPS_RPA3G2R) SERCOM0/PAD0  */
#define   PPS_RPA3G2R_RPA3G2R_SCOM0P3_Val     _UINT32_(0x2)                                        /* (PPS_RPA3G2R) SERCOM0/PAD3  */
#define   PPS_RPA3G2R_RPA3G2R_SCOM0P2_Val     _UINT32_(0x3)                                        /* (PPS_RPA3G2R) SERCOM0/PAD2  */
#define   PPS_RPA3G2R_RPA3G2R_SCOM1P1_Val     _UINT32_(0x4)                                        /* (PPS_RPA3G2R) SERCOM1/PAD1  */
#define   PPS_RPA3G2R_RPA3G2R_SCOM1P3_Val     _UINT32_(0x5)                                        /* (PPS_RPA3G2R) SERCOM1/PAD3  */
#define   PPS_RPA3G2R_RPA3G2R_SCOM1P2_Val     _UINT32_(0x6)                                        /* (PPS_RPA3G2R) SERCOM1/PAD2  */
#define   PPS_RPA3G2R_RPA3G2R_SCOM2P1_Val     _UINT32_(0x7)                                        /* (PPS_RPA3G2R) SERCOM2/PAD1  */
#define   PPS_RPA3G2R_RPA3G2R_SCOM2P2_Val     _UINT32_(0x8)                                        /* (PPS_RPA3G2R) SERCOM2/PAD2  */
#define   PPS_RPA3G2R_RPA3G2R_SCOM3P1_Val     _UINT32_(0x9)                                        /* (PPS_RPA3G2R) SERCOM3/PAD1  */
#define   PPS_RPA3G2R_RPA3G2R_SCOM3P0_Val     _UINT32_(0xA)                                        /* (PPS_RPA3G2R) SERCOM3/PAD0  */
#define   PPS_RPA3G2R_RPA3G2R_TCC0WO1_Val     _UINT32_(0xB)                                        /* (PPS_RPA3G2R) TCC0/WO1  */
#define   PPS_RPA3G2R_RPA3G2R_TCC0WO5_Val     _UINT32_(0xC)                                        /* (PPS_RPA3G2R) TCC0/WO5  */
#define   PPS_RPA3G2R_RPA3G2R_TCC0WO3_Val     _UINT32_(0xD)                                        /* (PPS_RPA3G2R) TCC0/WO3  */
#define   PPS_RPA3G2R_RPA3G2R_TCC1WO1_Val     _UINT32_(0xE)                                        /* (PPS_RPA3G2R) TCC1/WO1  */
#define   PPS_RPA3G2R_RPA3G2R_TCC1WO5_Val     _UINT32_(0xF)                                        /* (PPS_RPA3G2R) TCC1/WO5  */
#define   PPS_RPA3G2R_RPA3G2R_TCC1WO3_Val     _UINT32_(0x10)                                       /* (PPS_RPA3G2R) TCC1/WO3  */
#define   PPS_RPA3G2R_RPA3G2R_TCC2WO1_Val     _UINT32_(0x11)                                       /* (PPS_RPA3G2R) TCC2/WO1  */
#define   PPS_RPA3G2R_RPA3G2R_TC0WO1_Val      _UINT32_(0x12)                                       /* (PPS_RPA3G2R) TC0/WO1  */
#define   PPS_RPA3G2R_RPA3G2R_REFO2_Val       _UINT32_(0x13)                                       /* (PPS_RPA3G2R) REFO2  */
#define   PPS_RPA3G2R_RPA3G2R_TC1WO1_Val      _UINT32_(0x14)                                       /* (PPS_RPA3G2R) TC1/WO1  */
#define   PPS_RPA3G2R_RPA3G2R_TC2WO1_Val      _UINT32_(0x15)                                       /* (PPS_RPA3G2R) TC2/WO1  */
#define   PPS_RPA3G2R_RPA3G2R_TC3WO1_Val      _UINT32_(0x16)                                       /* (PPS_RPA3G2R) TC3/WO1  */
#define   PPS_RPA3G2R_RPA3G2R_QSCK_Val        _UINT32_(0x17)                                       /* (PPS_RPA3G2R) QSCK  */
#define   PPS_RPA3G2R_RPA3G2R_QCS_Val         _UINT32_(0x18)                                       /* (PPS_RPA3G2R) QCS  */
#define   PPS_RPA3G2R_RPA3G2R_QD0_Val         _UINT32_(0x19)                                       /* (PPS_RPA3G2R) QD0  */
#define   PPS_RPA3G2R_RPA3G2R_QD3_Val         _UINT32_(0x1A)                                       /* (PPS_RPA3G2R) QD3  */
#define   PPS_RPA3G2R_RPA3G2R_QD2_Val         _UINT32_(0x1B)                                       /* (PPS_RPA3G2R) QD2  */
#define   PPS_RPA3G2R_RPA3G2R_CCLOUT1_Val     _UINT32_(0x1C)                                       /* (PPS_RPA3G2R) CCLOUT1  */
#define   PPS_RPA3G2R_RPA3G2R_TSTBUS1_Val     _UINT32_(0x1D)                                       /* (PPS_RPA3G2R) TSTBUS1  */
#define   PPS_RPA3G2R_RPA3G2R_TSTBUS5_Val     _UINT32_(0x1E)                                       /* (PPS_RPA3G2R) TSTBUS5  */
#define   PPS_RPA3G2R_RPA3G2R_TSTBUS9_Val     _UINT32_(0x1F)                                       /* (PPS_RPA3G2R) TSTBUS9  */
#define PPS_RPA3G2R_RPA3G2R_OFF               (PPS_RPA3G2R_RPA3G2R_OFF_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) OFF Position  */
#define PPS_RPA3G2R_RPA3G2R_SCOM0P0           (PPS_RPA3G2R_RPA3G2R_SCOM0P0_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) SERCOM0/PAD0 Position  */
#define PPS_RPA3G2R_RPA3G2R_SCOM0P3           (PPS_RPA3G2R_RPA3G2R_SCOM0P3_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) SERCOM0/PAD3 Position  */
#define PPS_RPA3G2R_RPA3G2R_SCOM0P2           (PPS_RPA3G2R_RPA3G2R_SCOM0P2_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) SERCOM0/PAD2 Position  */
#define PPS_RPA3G2R_RPA3G2R_SCOM1P1           (PPS_RPA3G2R_RPA3G2R_SCOM1P1_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) SERCOM1/PAD1 Position  */
#define PPS_RPA3G2R_RPA3G2R_SCOM1P3           (PPS_RPA3G2R_RPA3G2R_SCOM1P3_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) SERCOM1/PAD3 Position  */
#define PPS_RPA3G2R_RPA3G2R_SCOM1P2           (PPS_RPA3G2R_RPA3G2R_SCOM1P2_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) SERCOM1/PAD2 Position  */
#define PPS_RPA3G2R_RPA3G2R_SCOM2P1           (PPS_RPA3G2R_RPA3G2R_SCOM2P1_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) SERCOM2/PAD1 Position  */
#define PPS_RPA3G2R_RPA3G2R_SCOM2P2           (PPS_RPA3G2R_RPA3G2R_SCOM2P2_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) SERCOM2/PAD2 Position  */
#define PPS_RPA3G2R_RPA3G2R_SCOM3P1           (PPS_RPA3G2R_RPA3G2R_SCOM3P1_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) SERCOM3/PAD1 Position  */
#define PPS_RPA3G2R_RPA3G2R_SCOM3P0           (PPS_RPA3G2R_RPA3G2R_SCOM3P0_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) SERCOM3/PAD0 Position  */
#define PPS_RPA3G2R_RPA3G2R_TCC0WO1           (PPS_RPA3G2R_RPA3G2R_TCC0WO1_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) TCC0/WO1 Position  */
#define PPS_RPA3G2R_RPA3G2R_TCC0WO5           (PPS_RPA3G2R_RPA3G2R_TCC0WO5_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) TCC0/WO5 Position  */
#define PPS_RPA3G2R_RPA3G2R_TCC0WO3           (PPS_RPA3G2R_RPA3G2R_TCC0WO3_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) TCC0/WO3 Position  */
#define PPS_RPA3G2R_RPA3G2R_TCC1WO1           (PPS_RPA3G2R_RPA3G2R_TCC1WO1_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) TCC1/WO1 Position  */
#define PPS_RPA3G2R_RPA3G2R_TCC1WO5           (PPS_RPA3G2R_RPA3G2R_TCC1WO5_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) TCC1/WO5 Position  */
#define PPS_RPA3G2R_RPA3G2R_TCC1WO3           (PPS_RPA3G2R_RPA3G2R_TCC1WO3_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) TCC1/WO3 Position  */
#define PPS_RPA3G2R_RPA3G2R_TCC2WO1           (PPS_RPA3G2R_RPA3G2R_TCC2WO1_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) TCC2/WO1 Position  */
#define PPS_RPA3G2R_RPA3G2R_TC0WO1            (PPS_RPA3G2R_RPA3G2R_TC0WO1_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) TC0/WO1 Position  */
#define PPS_RPA3G2R_RPA3G2R_REFO2             (PPS_RPA3G2R_RPA3G2R_REFO2_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) REFO2 Position  */
#define PPS_RPA3G2R_RPA3G2R_TC1WO1            (PPS_RPA3G2R_RPA3G2R_TC1WO1_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) TC1/WO1 Position  */
#define PPS_RPA3G2R_RPA3G2R_TC2WO1            (PPS_RPA3G2R_RPA3G2R_TC2WO1_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) TC2/WO1 Position  */
#define PPS_RPA3G2R_RPA3G2R_TC3WO1            (PPS_RPA3G2R_RPA3G2R_TC3WO1_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) TC3/WO1 Position  */
#define PPS_RPA3G2R_RPA3G2R_QSCK              (PPS_RPA3G2R_RPA3G2R_QSCK_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) QSCK Position  */
#define PPS_RPA3G2R_RPA3G2R_QCS               (PPS_RPA3G2R_RPA3G2R_QCS_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) QCS Position  */
#define PPS_RPA3G2R_RPA3G2R_QD0               (PPS_RPA3G2R_RPA3G2R_QD0_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) QD0 Position  */
#define PPS_RPA3G2R_RPA3G2R_QD3               (PPS_RPA3G2R_RPA3G2R_QD3_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) QD3 Position  */
#define PPS_RPA3G2R_RPA3G2R_QD2               (PPS_RPA3G2R_RPA3G2R_QD2_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) QD2 Position  */
#define PPS_RPA3G2R_RPA3G2R_CCLOUT1           (PPS_RPA3G2R_RPA3G2R_CCLOUT1_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) CCLOUT1 Position  */
#define PPS_RPA3G2R_RPA3G2R_TSTBUS1           (PPS_RPA3G2R_RPA3G2R_TSTBUS1_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) TSTBUS1 Position  */
#define PPS_RPA3G2R_RPA3G2R_TSTBUS5           (PPS_RPA3G2R_RPA3G2R_TSTBUS5_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) TSTBUS5 Position  */
#define PPS_RPA3G2R_RPA3G2R_TSTBUS9           (PPS_RPA3G2R_RPA3G2R_TSTBUS9_Val << PPS_RPA3G2R_RPA3G2R_Pos) /* (PPS_RPA3G2R) TSTBUS9 Position  */
#define PPS_RPA3G2R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_RPA3G2R) Register Mask  */


/* -------- PPS_RPA3G3R : (PPS Offset: 0x220) (R/W 32)  -------- */
#define PPS_RPA3G3R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPA3G3R)   Reset Value */

