Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_rfd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/pps.h
#define PPS_RPA10G4R_RPA10G4R_Pos             _UINT32_(0)                                          /* (PPS_RPA10G4R) RPA10/G4 Position */
#define PPS_RPA10G4R_RPA10G4R_Msk             (_UINT32_(0x1F) << PPS_RPA10G4R_RPA10G4R_Pos)        /* (PPS_RPA10G4R) RPA10/G4 Mask */
#define PPS_RPA10G4R_RPA10G4R(value)          (PPS_RPA10G4R_RPA10G4R_Msk & (_UINT32_(value) << PPS_RPA10G4R_RPA10G4R_Pos)) /* Assigment of value for RPA10G4R in the PPS_RPA10G4R register */
#define   PPS_RPA10G4R_RPA10G4R_OFF_Val       _UINT32_(0x0)                                        /* (PPS_RPA10G4R) OFF  */
#define   PPS_RPA10G4R_RPA10G4R_SCOM0P2_Val   _UINT32_(0x1)                                        /* (PPS_RPA10G4R) SERCOM0/PAD2  */
#define   PPS_RPA10G4R_RPA10G4R_SCOM0P1_Val   _UINT32_(0x2)                                        /* (PPS_RPA10G4R) SERCOM0/PAD1  */
#define   PPS_RPA10G4R_RPA10G4R_SCOM0P0_Val   _UINT32_(0x3)                                        /* (PPS_RPA10G4R) SERCOM0/PAD0  */
#define   PPS_RPA10G4R_RPA10G4R_SCOM1P3_Val   _UINT32_(0x4)                                        /* (PPS_RPA10G4R) SERCOM1/PAD3  */
#define   PPS_RPA10G4R_RPA10G4R_SCOM1P1_Val   _UINT32_(0x5)                                        /* (PPS_RPA10G4R) SERCOM1/PAD1  */
#define   PPS_RPA10G4R_RPA10G4R_SCOM1P0_Val   _UINT32_(0x6)                                        /* (PPS_RPA10G4R) SERCOM1/PAD0  */
#define   PPS_RPA10G4R_RPA10G4R_SCOM2P3_Val   _UINT32_(0x7)                                        /* (PPS_RPA10G4R) SERCOM2/PAD3  */
#define   PPS_RPA10G4R_RPA10G4R_SCOM2P0_Val   _UINT32_(0x8)                                        /* (PPS_RPA10G4R) SERCOM2/PAD0  */
#define   PPS_RPA10G4R_RPA10G4R_SCOM3P3_Val   _UINT32_(0x9)                                        /* (PPS_RPA10G4R) SERCOM3/PAD3  */
#define   PPS_RPA10G4R_RPA10G4R_SCOM3P2_Val   _UINT32_(0xA)                                        /* (PPS_RPA10G4R) SERCOM3/PAD2  */
#define   PPS_RPA10G4R_RPA10G4R_TCC0WO3_Val   _UINT32_(0xB)                                        /* (PPS_RPA10G4R) TCC0/WO3  */
#define   PPS_RPA10G4R_RPA10G4R_TCC0WO1_Val   _UINT32_(0xC)                                        /* (PPS_RPA10G4R) TCC0/WO1  */
#define   PPS_RPA10G4R_RPA10G4R_TCC0WO5_Val   _UINT32_(0xD)                                        /* (PPS_RPA10G4R) TCC0/WO5  */
#define   PPS_RPA10G4R_RPA10G4R_TCC1WO3_Val   _UINT32_(0xE)                                        /* (PPS_RPA10G4R) TCC1/WO3  */
#define   PPS_RPA10G4R_RPA10G4R_TCC1WO1_Val   _UINT32_(0xF)                                        /* (PPS_RPA10G4R) TCC1/WO1  */
#define   PPS_RPA10G4R_RPA10G4R_TCC1WO5_Val   _UINT32_(0x10)                                       /* (PPS_RPA10G4R) TCC1/WO5  */
#define   PPS_RPA10G4R_RPA10G4R_TCC2WO1_Val   _UINT32_(0x11)                                       /* (PPS_RPA10G4R) TCC2/WO1  */
#define   PPS_RPA10G4R_RPA10G4R_TC0WO0_Val    _UINT32_(0x12)                                       /* (PPS_RPA10G4R) TC0/WO0  */
#define   PPS_RPA10G4R_RPA10G4R_REFO4_Val     _UINT32_(0x13)                                       /* (PPS_RPA10G4R) REFO4  */
#define   PPS_RPA10G4R_RPA10G4R_TC1WO1_Val    _UINT32_(0x14)                                       /* (PPS_RPA10G4R) TC1/WO1  */
#define   PPS_RPA10G4R_RPA10G4R_TC2WO1_Val    _UINT32_(0x15)                                       /* (PPS_RPA10G4R) TC2/WO1  */
#define   PPS_RPA10G4R_RPA10G4R_TC3WO1_Val    _UINT32_(0x16)                                       /* (PPS_RPA10G4R) TC3/WO1  */
#define   PPS_RPA10G4R_RPA10G4R_QSCK_Val      _UINT32_(0x17)                                       /* (PPS_RPA10G4R) QSCK  */
#define   PPS_RPA10G4R_RPA10G4R_QCS_Val       _UINT32_(0x18)                                       /* (PPS_RPA10G4R) QCS  */
#define   PPS_RPA10G4R_RPA10G4R_QD2_Val       _UINT32_(0x19)                                       /* (PPS_RPA10G4R) QD2  */
#define   PPS_RPA10G4R_RPA10G4R_QD1_Val       _UINT32_(0x1A)                                       /* (PPS_RPA10G4R) QD1  */
#define   PPS_RPA10G4R_RPA10G4R_QD0_Val       _UINT32_(0x1B)                                       /* (PPS_RPA10G4R) QD0  */
#define   PPS_RPA10G4R_RPA10G4R_CCLOUT1_Val   _UINT32_(0x1C)                                       /* (PPS_RPA10G4R) CCLOUT1  */
#define   PPS_RPA10G4R_RPA10G4R_TSTBUS3_Val   _UINT32_(0x1D)                                       /* (PPS_RPA10G4R) TSTBUS3  */
#define   PPS_RPA10G4R_RPA10G4R_TSTBUS7_Val   _UINT32_(0x1E)                                       /* (PPS_RPA10G4R) TSTBUS7  */
#define   PPS_RPA10G4R_RPA10G4R_TSTBUS11_Val  _UINT32_(0x1F)                                       /* (PPS_RPA10G4R) TSTBUS11  */
#define PPS_RPA10G4R_RPA10G4R_OFF             (PPS_RPA10G4R_RPA10G4R_OFF_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) OFF Position  */
#define PPS_RPA10G4R_RPA10G4R_SCOM0P2         (PPS_RPA10G4R_RPA10G4R_SCOM0P2_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) SERCOM0/PAD2 Position  */
#define PPS_RPA10G4R_RPA10G4R_SCOM0P1         (PPS_RPA10G4R_RPA10G4R_SCOM0P1_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) SERCOM0/PAD1 Position  */
#define PPS_RPA10G4R_RPA10G4R_SCOM0P0         (PPS_RPA10G4R_RPA10G4R_SCOM0P0_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) SERCOM0/PAD0 Position  */
#define PPS_RPA10G4R_RPA10G4R_SCOM1P3         (PPS_RPA10G4R_RPA10G4R_SCOM1P3_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) SERCOM1/PAD3 Position  */
#define PPS_RPA10G4R_RPA10G4R_SCOM1P1         (PPS_RPA10G4R_RPA10G4R_SCOM1P1_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) SERCOM1/PAD1 Position  */
#define PPS_RPA10G4R_RPA10G4R_SCOM1P0         (PPS_RPA10G4R_RPA10G4R_SCOM1P0_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) SERCOM1/PAD0 Position  */
#define PPS_RPA10G4R_RPA10G4R_SCOM2P3         (PPS_RPA10G4R_RPA10G4R_SCOM2P3_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) SERCOM2/PAD3 Position  */
#define PPS_RPA10G4R_RPA10G4R_SCOM2P0         (PPS_RPA10G4R_RPA10G4R_SCOM2P0_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) SERCOM2/PAD0 Position  */
#define PPS_RPA10G4R_RPA10G4R_SCOM3P3         (PPS_RPA10G4R_RPA10G4R_SCOM3P3_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) SERCOM3/PAD3 Position  */
#define PPS_RPA10G4R_RPA10G4R_SCOM3P2         (PPS_RPA10G4R_RPA10G4R_SCOM3P2_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) SERCOM3/PAD2 Position  */
#define PPS_RPA10G4R_RPA10G4R_TCC0WO3         (PPS_RPA10G4R_RPA10G4R_TCC0WO3_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) TCC0/WO3 Position  */
#define PPS_RPA10G4R_RPA10G4R_TCC0WO1         (PPS_RPA10G4R_RPA10G4R_TCC0WO1_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) TCC0/WO1 Position  */
#define PPS_RPA10G4R_RPA10G4R_TCC0WO5         (PPS_RPA10G4R_RPA10G4R_TCC0WO5_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) TCC0/WO5 Position  */
#define PPS_RPA10G4R_RPA10G4R_TCC1WO3         (PPS_RPA10G4R_RPA10G4R_TCC1WO3_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) TCC1/WO3 Position  */
#define PPS_RPA10G4R_RPA10G4R_TCC1WO1         (PPS_RPA10G4R_RPA10G4R_TCC1WO1_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) TCC1/WO1 Position  */
#define PPS_RPA10G4R_RPA10G4R_TCC1WO5         (PPS_RPA10G4R_RPA10G4R_TCC1WO5_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) TCC1/WO5 Position  */
#define PPS_RPA10G4R_RPA10G4R_TCC2WO1         (PPS_RPA10G4R_RPA10G4R_TCC2WO1_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) TCC2/WO1 Position  */
#define PPS_RPA10G4R_RPA10G4R_TC0WO0          (PPS_RPA10G4R_RPA10G4R_TC0WO0_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) TC0/WO0 Position  */
#define PPS_RPA10G4R_RPA10G4R_REFO4           (PPS_RPA10G4R_RPA10G4R_REFO4_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) REFO4 Position  */
#define PPS_RPA10G4R_RPA10G4R_TC1WO1          (PPS_RPA10G4R_RPA10G4R_TC1WO1_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) TC1/WO1 Position  */
#define PPS_RPA10G4R_RPA10G4R_TC2WO1          (PPS_RPA10G4R_RPA10G4R_TC2WO1_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) TC2/WO1 Position  */
#define PPS_RPA10G4R_RPA10G4R_TC3WO1          (PPS_RPA10G4R_RPA10G4R_TC3WO1_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) TC3/WO1 Position  */
#define PPS_RPA10G4R_RPA10G4R_QSCK            (PPS_RPA10G4R_RPA10G4R_QSCK_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) QSCK Position  */
#define PPS_RPA10G4R_RPA10G4R_QCS             (PPS_RPA10G4R_RPA10G4R_QCS_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) QCS Position  */
#define PPS_RPA10G4R_RPA10G4R_QD2             (PPS_RPA10G4R_RPA10G4R_QD2_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) QD2 Position  */
#define PPS_RPA10G4R_RPA10G4R_QD1             (PPS_RPA10G4R_RPA10G4R_QD1_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) QD1 Position  */
#define PPS_RPA10G4R_RPA10G4R_QD0             (PPS_RPA10G4R_RPA10G4R_QD0_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) QD0 Position  */
#define PPS_RPA10G4R_RPA10G4R_CCLOUT1         (PPS_RPA10G4R_RPA10G4R_CCLOUT1_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) CCLOUT1 Position  */
#define PPS_RPA10G4R_RPA10G4R_TSTBUS3         (PPS_RPA10G4R_RPA10G4R_TSTBUS3_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) TSTBUS3 Position  */
#define PPS_RPA10G4R_RPA10G4R_TSTBUS7         (PPS_RPA10G4R_RPA10G4R_TSTBUS7_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) TSTBUS7 Position  */
#define PPS_RPA10G4R_RPA10G4R_TSTBUS11        (PPS_RPA10G4R_RPA10G4R_TSTBUS11_Val << PPS_RPA10G4R_RPA10G4R_Pos) /* (PPS_RPA10G4R) TSTBUS11 Position  */
#define PPS_RPA10G4R_Msk                      _UINT32_(0x0000001F)                                 /* (PPS_RPA10G4R) Register Mask  */


